---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.WrongConstraintInGridChainSketch
source: html/2735a012-5c19-4a20-4d3d-ab7fcbffe874.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.WrongConstraintInGridChainSketch Property

Curve in a GridChain sketch cannot be constrained to a sub-grid

## Syntax (C#)
```csharp
public static FailureDefinitionId WrongConstraintInGridChainSketch { get; }
```